# Ultralytics YOLO11-pose keypoints/pose estimation model (타이어 2키포인트용)
# 참고: https://docs.ultralytics.com/models/yolo11

#yolo11-pose 키포인트 모델 커스텀
nc: 1  # 클래스 수 (tire)
kpt_shape: [4, 3]  # 4개의 키포인트, (x, y, visible)
scales:
  m: [0.50, 1.00, 512]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] #1
  - [-1, 1, Conv, [128, 3, 2]] #2
  - [-1, 2, C3k2, [256, False, 0.25]] #3
  - [-1, 1, Conv, [256, 3, 2]] #4
  - [-1, 2, C3k2, [512, False, 0.25]] #5
  - [-1, 1, Conv, [512, 3, 2]] #6
  - [-1, 2, C3k2, [512, True]] #7
  - [-1, 1, Conv, [1024, 3, 2]] #8
  - [-1, 2, C3k2, [1024, True]] #9
  - [-1, 1, SPPF, [1024, 5]] #10
  - [-1, 2, C2PSA, [1024]] #11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 19, 22], 1, Pose, [nc, kpt_shape]]